dict_of_number = {'Майкоп': 1, 'Барнаул': 2, 'Выбратьгород': 111, 'Благовещенск': 4, 'Архангельск': 5, 'Астрахань': 7,
                  'Уфа': 8, 'Стерлитамак': 9, 'Белорецк': 10, 'Белгород': 11, 'Старый Оскол': 12, 'Брянск': 13,
                  'Улан-Удэ': 14, 'Владимир': 15, 'Волгоград': 16, 'Вологда': 17, 'Череповец': 18, 'Воронеж': 19,
                  'Махачкала': 20, 'Биробиджан': 21, 'Чита': 22, 'Иваново': 23, 'Иркутск': 25, 'Калининград': 27,
                  'Калуга': 28, 'Обнинск': 29, 'Петропавловск-Камчатский': 30, 'Черкесск': 31, 'Петрозаводск': 33,
                  'Кемерово': 34, 'Киров': 35, 'Кирово-Чепецк': 36, 'Сыктывкар': 37, 'Ухта': 38, 'Краснодар': 40,
                  'Сочи': 41, 'Новороссийск': 42, 'Анапа': 43, 'Геленджик': 44, 'Красноярск': 45, 'Железногорск': 46,
                  'Норильск': 47, 'Курган': 48, 'Курск': 49, 'Санкт-Петербург': 50, 'Выборг': 51, 'Сосновый Бор': 52,
                  'Липецк': 53, 'Елец': 54, 'Магадан': 55, 'Саранск': 58, 'Москва': 59, 'Серпухов': 60, 'Электросталь': 61,
                  'Дмитров': 62, 'Подольск': 63, 'Балашиха': 64, 'Химки': 65, 'Мурманск': 66, 'Нижний Новгород': 67,
                  'Великий Новгород': 68, 'Новосибирск': 69, 'Омск': 70, 'Оренбург': 71, 'Орск': 72, 'Орел': 73, 'Пенза': 74,
                  'Пермь': 75, 'Владивосток': 76, 'Псков': 77, 'Ростов-на-Дону': 78, 'Таганрог': 79, 'Рязань': 80, 'Самара': 81,
                  'Тольятти': 82, 'Екатеринбург': 83, 'Нижний Тагил': 84, 'Каменск-Уральск': 85, 'Саратов': 86, 'Якутск': 87,
                  'Южно-Сахалинск': 88, 'Владикавказ': 89, 'Смоленск': 90, 'Ставрополь': 91, 'Пятигорск': 92, 'Кисловодск': 93,
                  'Ессентуки': 94, 'Тамбов': 95, 'Мичуринск': 96, 'Казань': 98, 'Набережные Челны': 99, 'Альметьевск': 100,
                  'Нижнекамск': 101, 'Елабуга': 102, 'Тверь': 103, 'Конаково': 104, 'Ржев': 105, 'Вышний Волочек': 106,
                  'Томск': 107, 'Тула': 109, 'Новомосковск': 110, 'Нижневартовск': 112, 'Сургут': 113, 'Тюмень': 114, 'Ханты-Мансийск': 115}

print(stroka)

print(len(dict_of_number))